of70/tutorials/rheoHeatFoam/BernardCells/Newtonian/constant/thermoProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermoProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type            boussinesq;

enableViscousDissipation false;

rhoCp           rhoCp [ 1 -1 -2 -1 0 0 0 ] 1000;
beta            beta [0 0 0 -1 0 0 0] 1e-3;
TRef            TRef [0 0 0 1 0 0 0] 300;

kappaCoeffs
{
    a0              1;
    a1              0;
    a2              0;
    a3              0;
}

// ************************************************************************* //
